app/controllers/characters_controller.rb

  def index
    @characters = Character.all
---
SELECT "characters".* FROM "characters"

  def show
    @character = Character.find(params[:id])
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @character = Character.create!(character_params)
---
INSERT INTO "characters" ("name", "img_url", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "x"], ["img_url", "www.scrotomoto.co"], ["house_id", 1], ["created_at", 2017-02-24 21:08:32 UTC], ["updated_at", 2017-02-24 21:08:32 UTC]]

def edit
  @character = Character.find(params[:id])
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

def update
  @character = Character.find(params[:id])
  @character.update(                character_params)
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "characters" SET "img_url" = $1, "updated_at" = $2 WHERE "characters"."id" = $3  [["img_url", "https://www.ablogofthrones.com/wp-content/uploads/2016/03/Lady-Stoneheart-FEAT-750x412.jpg"], ["updated_at", 2017-02-24 20:03:51 UTC], ["id", 2]]